tests/MessageReplay.Tests/JsonToSoap/JsonToSoapConverterTests.When_receiving_clearance_request_soap_Then_should_convert_to_json_Cds.verified.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soap:Header>
    <oas:Security soap:role="system" soap:mustUnderstand="true">
      <oas:UsernameToken>
        <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
        <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
      </oas:UsernameToken>
    </oas:Security>
  </soap:Header>
  <soap:Body>
    <ALVSClearanceRequest xmlns="http://submitimportdocumenthmrcfacade.types.esb.ws.cara.defra.com">
      <ServiceHeader>
        <SourceSystem>CDS</SourceSystem>
        <DestinationSystem>ALVS</DestinationSystem>
        <CorrelationId>179120009100989</CorrelationId>
        <ServiceCallTimestamp>2013-10-18T16:55:00.000</ServiceCallTimestamp>
      </ServiceHeader>
      <Header>
        <EntryReference>24DSW01TST9009AR63</EntryReference>
        <EntryVersionNumber>1</EntryVersionNumber>
        <DeclarationUCR>4DP99000000000-TST63</DeclarationUCR>
        <DeclarationType>S</DeclarationType>
        <ArrivalDateTime>201310220900</ArrivalDateTime>
        <SubmitterTURN>123456789012345</SubmitterTURN>
        <DeclarantId>GBTRANSITAIR</DeclarantId>
        <DeclarantName>TRANSITAIR.GB</DeclarantName>
        <DispatchCountryCode>GB</DispatchCountryCode>
        <GoodsLocationCode>BELBELBEL</GoodsLocationCode>
        <MasterUCR>GB/TRANSITAIR-01</MasterUCR>
      </Header>
      <Item>
        <ItemNumber>1</ItemNumber>
        <CustomsProcedureCode>4000061</CustomsProcedureCode>
        <TaricCommodityCode>0808108010</TaricCommodityCode>
        <GoodsDescription>Test Test</GoodsDescription>
        <ConsigneeId>NIIMPORTS</ConsigneeId>
        <ConsigneeName>Importers Ltd</ConsigneeName>
        <ItemNetMass>31</ItemNetMass>
        <ItemSupplementaryUnits>0</ItemSupplementaryUnits>
        <ItemThirdQuantity>0</ItemThirdQuantity>
        <ItemOriginCountryCode>GB</ItemOriginCountryCode>
        <Document>
          <DocumentCode>N851</DocumentCode>
          <DocumentReference>GBCHD2024.7360439</DocumentReference>
          <DocumentStatus>St</DocumentStatus>
          <DocumentControl>S</DocumentControl>
        </Document>
        <Check>
          <CheckCode>H219</CheckCode>
          <DepartmentCode>PHSI</DepartmentCode>
        </Check>
      </Item>
      <Item>
        <ItemNumber>2</ItemNumber>
        <CustomsProcedureCode>4000061</CustomsProcedureCode>
        <TaricCommodityCode>0808108010</TaricCommodityCode>
        <GoodsDescription>Test Test</GoodsDescription>
        <ConsigneeId>NIIMPORTS</ConsigneeId>
        <ConsigneeName>Importers Ltd</ConsigneeName>
        <ItemNetMass>11</ItemNetMass>
        <ItemSupplementaryUnits>0</ItemSupplementaryUnits>
        <ItemThirdQuantity>0</ItemThirdQuantity>
        <ItemOriginCountryCode>GB</ItemOriginCountryCode>
        <Document>
          <DocumentCode>N851</DocumentCode>
          <DocumentReference>GBCHD2024.7360439</DocumentReference>
          <DocumentStatus>St</DocumentStatus>
          <DocumentControl>S</DocumentControl>
        </Document>
        <Check>
          <CheckCode>H219</CheckCode>
          <DepartmentCode>PHSI</DepartmentCode>
        </Check>
      </Item>
      <Item>
        <ItemNumber>3</ItemNumber>
        <CustomsProcedureCode>4000061</CustomsProcedureCode>
        <TaricCommodityCode>0709601000</TaricCommodityCode>
        <GoodsDescription>Test Test</GoodsDescription>
        <ConsigneeId>NIIMPORTS</ConsigneeId>
        <ConsigneeName>Importers Ltd</ConsigneeName>
        <ItemNetMass>43</ItemNetMass>
        <ItemSupplementaryUnits>0</ItemSupplementaryUnits>
        <ItemThirdQuantity>0</ItemThirdQuantity>
        <ItemOriginCountryCode>GB</ItemOriginCountryCode>
        <Document>
          <DocumentCode>N851</DocumentCode>
          <DocumentReference>GBCHD2024.7360439</DocumentReference>
          <DocumentStatus>St</DocumentStatus>
          <DocumentControl>S</DocumentControl>
        </Document>
        <Document>
          <DocumentCode>N002</DocumentCode>
          <DocumentReference>GBCHD2024.7360439</DocumentReference>
          <DocumentStatus>St</DocumentStatus>
          <DocumentControl>S</DocumentControl>
        </Document>
        <Check>
          <CheckCode>H219</CheckCode>
          <DepartmentCode>PHSI</DepartmentCode>
        </Check>
        <Check>
          <CheckCode>H218</CheckCode>
          <DepartmentCode>HMI</DepartmentCode>
        </Check>
      </Item>
      <Item>
        <ItemNumber>4</ItemNumber>
        <CustomsProcedureCode>4000061</CustomsProcedureCode>
        <TaricCommodityCode>0709601000</TaricCommodityCode>
        <GoodsDescription>Test Test</GoodsDescription>
        <ConsigneeId>NIIMPORTS</ConsigneeId>
        <ConsigneeName>Importers Ltd</ConsigneeName>
        <ItemNetMass>22</ItemNetMass>
        <ItemSupplementaryUnits>0</ItemSupplementaryUnits>
        <ItemThirdQuantity>0</ItemThirdQuantity>
        <ItemOriginCountryCode>GB</ItemOriginCountryCode>
        <Document>
          <DocumentCode>N851</DocumentCode>
          <DocumentReference>GBCHD2024.7360439</DocumentReference>
          <DocumentStatus>St</DocumentStatus>
          <DocumentControl>S</DocumentControl>
        </Document>
        <Document>
          <DocumentCode>N002</DocumentCode>
          <DocumentReference>GBCHD2024.7360439</DocumentReference>
          <DocumentStatus>St</DocumentStatus>
          <DocumentControl>S</DocumentControl>
        </Document>
        <Check>
          <CheckCode>H219</CheckCode>
          <DepartmentCode>PHSI</DepartmentCode>
        </Check>
        <Check>
          <CheckCode>H218</CheckCode>
          <DepartmentCode>HMI</DepartmentCode>
        </Check>
      </Item>
    </ALVSClearanceRequest>
  </soap:Body>
</soap:Envelope>